[
  {
    "id": "1-lk2jd",
    "question": "Some people believe that universities should only accept students with the highest marks. Others think that all students should be given a chance. Discuss both views and give your opinion."
  },
  {
    "id": "2-nx4vb",
    "question": "Nowadays many people choose to be self-employed rather than work for a company. Why might this be the case? What could be the disadvantages of being self-employed?"
  },
  {
    "id": "3-wq8yd",
    "question": "In some countries, children are becoming overweight and unhealthy. Some people think that the government should be responsible. To what extent do you agree or disagree?"
  },
  {
    "id": "4-md2cz",
    "question": "Some people think it is more important to spend money on roads and motorways than on public transportation. To what extent do you agree or disagree?"
  },
  {
    "id": "5-rk9up",
    "question": "Some people say that the main purpose of education is to prepare individuals to be useful members of society. Others say it should help people to achieve personal ambitions. Discuss both views and give your opinion."
  },
  {
    "id": "6-jt7kn",
    "question": "Many people believe that social networking sites have a negative impact on individuals and society. To what extent do you agree or disagree?"
  },
  {
    "id": "7-zn3qy",
    "question": "Some people think that the government should make university education free for everyone. To what extent do you agree or disagree?"
  },
  {
    "id": "8-vc0lg",
    "question": "Some people believe that money is the most important factor for achieving happiness. Others believe that relationships and health are more important. Discuss both views and give your opinion."
  },
  {
    "id": "9-rb6so",
    "question": "More and more people are choosing to live in cities. Do the advantages of living in cities outweigh the disadvantages?"
  },
  {
    "id": "10-pm4bx",
    "question": "Some people think that it is better to include more physical education classes in the school curriculum. To what extent do you agree or disagree?"
  },
  {
    "id": "11-xw3ve",
    "question": "Some believe that people should make efforts to fight climate change, while others think they should learn to live with it. Discuss both views and give your opinion."
  },
  {
    "id": "12-aq2kn",
    "question": "Many countries face serious problems with their environments, such as pollution and climate change. What are the causes of these problems and what can individuals and governments do to solve them?"
  },
  {
    "id": "13-gm6ru",
    "question": "People are living longer these days. What are the advantages and disadvantages of this trend?"
  },
  {
    "id": "14-fy5qd",
    "question": "Some people believe that students should learn a foreign language from primary school, while others think it is better to start in secondary school. Discuss both views and give your opinion."
  },
  {
    "id": "15-bt1ho",
    "question": "In many countries, there is a shortage of housing due to growing populations. What are the causes of this problem and what can be done to solve it?"
  },
  {
    "id": "16-lz0mx",
    "question": "Some people think that advertisements are useful for consumers. Others think they create unnecessary desire. Discuss both views and give your opinion."
  },
  {
    "id": "17-uk8df",
    "question": "The use of mobile phones in public places is becoming more common. Do the advantages outweigh the disadvantages?"
  },
  {
    "id": "18-ke4sn",
    "question": "Some people believe that children should be given homework every day, while others believe it is unnecessary. Discuss both views and give your opinion."
  },
  {
    "id": "19-yj7vc",
    "question": "Some people say that online learning is more effective than traditional classroom learning. To what extent do you agree or disagree?"
  },
  {
    "id": "20-hn3qp",
    "question": "Many people think that young people should spend more time on outdoor activities than on computers. Do you agree or disagree?"
  }
]
